Дипломная_работа/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная_работа/src/AccumulationRegisters/ВКМ_ПлановыеОтпуска/ВКМ_ПлановыеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ПлановыеОтпуска</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломная_работа/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте

Перем АдресВХранилище;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Строки = ПодсчетКоличестваДней();  

	Для каждого стр из Объект.ОтпускаСотрудников Цикл
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();  
	ЭлементОформления.Использование = Истина;     
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Коралловый);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
	ЭлементОтбора.ПравоеЗначение = Строки; 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;

	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
	ПолеОформления.Использование = Истина;    
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресВХранилище = ПоместитьВХранилище();
	
	ПараметрыПодбора = Новый Структура("Адрес", АдресВХранилище);
	
	ФормаПодбора = ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры

&НаСервере

Функция ПоместитьВХранилище()
    
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(),УникальныйИдентификатор);  
	
КонецФункции     

  &НаСервере
Функция ПодсчетКоличестваДней()   
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ПлановыеОтпуска.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ПлановыеОтпуска.КоличествоДней) КАК КоличествоДней
	|ИЗ
	|	РегистрНакопления.ВКМ_ПлановыеОтпуска КАК ВКМ_ПлановыеОтпуска
	|ГДЕ
	|	ВКМ_ПлановыеОтпуска.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ПлановыеОтпуска.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СписокСотрудниковДляПодсветки = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоДней > 28 Тогда
			СписокСотрудниковДляПодсветки.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
		КонецЕсли;	 
	КонецЦикла;
	
	Возврат СписокСотрудниковДляПодсветки;
	
КонецФункции
